Repository: aalvsz/iOS-workout-health-app
Catalog: FitPulse/Localizable.xcstrings
Source language: en
Languages: es, fr

source: No Gemma 3 1B model found. Please ensure the model file is bundled with the app.
es: No se encontró el modelo Gemma 3 1B. Asegúrate de que el archivo del modelo esté incluido en la app.
fr: Modèle Gemma 3 1B introuvable. Assurez-vous que le fichier du modèle est inclus dans l'application.

source: No Templates Yet
es: Sin plantillas aún
fr: Aucun modèle pour l'instant

source: No Weight Data
es: Sin datos de peso
fr: Aucune donnée de poids

source: No model is loaded. Please select a model in settings.
es: No hay modelo cargado. Selecciona un modelo en ajustes.
fr: Aucun modèle chargé. Veuillez sélectionner un modèle dans les paramètres.

source: No nutrition data available
es: No hay datos de nutrición disponibles
fr: Aucune donnée nutritionnelle disponible

source: No recovery data available
es: No hay datos de recuperación disponibles
fr: Aucune donnée de récupération disponible

source: No weight data available
es: No hay datos de peso disponibles
fr: Aucune donnée de poids disponible

source: No workout data available
es: No hay datos de entrenamiento disponibles
fr: Aucune donnée d'entraînement disponible

source: Notes
es: Notas

source: Notifications
es: Notificaciones

source: Nutrition
es: Nutrición

source: Nutrition Adherence
es: Adherencia nutricional
fr: Adhérence nutritionnelle

source: Nutrition Advisor
es: Asesor nutricional
fr: Conseiller nutritionnel

source: Nutrition On Point
es: Nutrición al día
fr: Nutrition au point

source: Nutrition Settings
es: Ajustes de nutrición
fr: Paramètres de nutrition

source: Nutrition Setup
es: Configuración de nutrición
fr: Configuration de la nutrition

source: Nutrition Targets
es: Objetivos nutricionales
fr: Objectifs nutritionnels

source: Nutrition and hydration on point. Keep the momentum going.
es: Nutrición e hidratación al día. Mantén el impulso.
fr: Nutrition et hydratation au point. Gardez l'élan.

source: Oatmeal with peanut butter and berries
es: Avena con mantequilla de cacahuete y frutos rojos
fr: Flocons d'avoine avec beurre de cacahuète et fruits rouges

source: Obese
es: Obesidad
fr: Obésité

source: On track to reach your goal by
es: En camino de alcanzar tu objetivo para
fr: En bonne voie pour atteindre votre objectif d'ici

source: One more workout to hit your weekly goal.
es: Un entrenamiento más para alcanzar tu objetivo semanal.
fr: Encore un entraînement pour atteindre votre objectif hebdomadaire.

source: Optional notes
es: Notas opcionales
fr: Notes facultatives

source: Other
es: Otro
fr: Autre

source: Overall
es: General
fr: Global

source: Overweight
es: Sobrepeso
fr: Surpoids

source: Personal Best
es: Mejor marca personal
fr: Record personnel

source: Personal best: %lld days
es: Mejor marca: %lld días
fr: Record personnel : %lld jours

source: Personalized meal plans based on your activity
es: Planes de comida personalizados basados en tu actividad
fr: Plans de repas personnalisés basés sur votre activité

source: Platinum
es: Platino
fr: Platine

source: Please configure your API key in Profile > AI Settings
es: Configura tu clave API en Perfil > Ajustes de IA
fr: Veuillez configurer votre clé API dans Profil > Paramètres IA

source: Preferences
es: Preferencias
fr: Préférences

source: Premium Analytics
es: Analíticas Premium
fr: Analytique Premium

source: Preparing Gemma 3 1B model...
es: Preparando modelo Gemma 3 1B...
fr: Préparation du modèle Gemma 3 1B...

source: Primary
es: Principal
fr: Principal

source: Privacy Policy
es: Política de privacidad
fr: Politique de confidentialité

source: Profile
es: Perfil
fr: Profil

source: Progress
es: Progreso
fr: Progrès

source: Progress & Engagement
es: Progreso y compromiso
fr: Progrès et engagement

source: Protein
es: Proteína
fr: Protéine

source: Protein Boost Needed
es: Necesitas más proteína
fr: Besoin d'un boost de protéines

source: Protein Target
es: Objetivo de proteína
fr: Objectif de protéines

source: Protein shake with banana
es: Batido de proteína con plátano
fr: Shake protéiné à la banane

source: Pull-Up Bar
es: Barra de dominadas
fr: Barre de traction

source: Quads
es: Cuádriceps
fr: Quadriceps

source: Quick Add
es: Añadir rápido
fr: Ajout rapide

source: Ready for a Challenge?
es: ¿Listo para un desafío?
fr: Prêt pour un défi ?

source: Recent Entries
es: Entradas recientes
fr: Entrées récentes

source: Recent Workouts
es: Entrenamientos recientes
fr: Entraînements récents

source: Recently Unlocked
es: Desbloqueados recientemente
fr: Récemment débloqués

source: Recommended protein: 1.6-2.2 g/kg for muscle building
es: Proteína recomendada: 1,6-2,2 g/kg para ganar músculo
fr: Protéines recommandées : 1,6-2,2 g/kg pour la prise de muscle

source: Recommended: %.1f-%.1f g/kg for your goal
es: Recomendado: %.1f-%.1f g/kg para tu objetivo
fr: Recommandé : %.1f-%.1f g/kg pour votre objectif

source: Recovery
es: Recuperación
fr: Récupération

source: Recovery Alert
es: Alerta de recuperación
fr: Alerte de récupération

source: Recovery Insights
es: Análisis de recuperación
fr: Analyses de récupération

source: Recovery Tracking
es: Seguimiento de recuperación
fr: Suivi de récupération

source: Recovery Trend
es: Tendencia de recuperación
fr: Tendance de récupération

source: Recovery is optimal. %lld workout(s) left this week.
es: La recuperación es óptima. %lld entrenamiento(s) restante(s) esta semana.
fr: La récupération est optimale. %lld entraînement(s) restant(s) cette semaine.

source: Recovery window: %lld min left
es: Ventana de recuperación: %lld min restantes
fr: Fenêtre de récupération : %lld min restantes

source: Recovery: %@
es: Recuperación: %@
fr: Récupération : %@

source: Regenerate
es: Regenerar
fr: Régénérer

source: Remaining
es: Restante
fr: Restant

source: Reset
es: Restablecer
fr: Réinitialiser

source: Reset Profile
es: Restablecer perfil
fr: Réinitialiser le profil

source: Reset Profile?
es: ¿Restablecer perfil?
fr: Réinitialiser le profil ?

source: Resistance Band
es: Banda de resistencia
fr: Bande de résistance

source: Rest & Recover
es: Descanso y recuperación
fr: Repos et récupération

source: Restore Purchases
es: Restaurar compras
fr: Restaurer les achats

source: Retry
es: Reintentar
fr: Réessayer

source: Review Plan
es: Revisar plan
fr: Revoir le plan

source: Save
es: Guardar
fr: Enregistrer

source: Save 50%
es: Ahorra 50%
fr: Économisez 50%

source: Schedule
es: Horario
fr: Programme

source: Schedule & Preferences
es: Horario y preferencias
fr: Programme et préférences

source: Search exercises
es: Buscar ejercicios
fr: Rechercher des exercices

source: Secondary
es: Secundario
fr: Secondaire

source: Section
es: Sección

source: Sedentary
es: Sedentario
fr: Sédentaire

source: See All
es: Ver todo
fr: Voir tout

source: See This Week's Challenge
es: Ver el desafío de esta semana
fr: Voir le défi de cette semaine

source: Select muscle groups to focus on and equipment you have access to
es: Selecciona grupos musculares y el equipamiento que tienes
fr: Sélectionnez les groupes musculaires et l'équipement auquel vous avez accès

source: Session length
es: Duración de la sesión
fr: Durée de la séance

source: Set your training schedule and split preference
es: Configura tu horario de entrenamiento y preferencia de división
fr: Configurez votre programme d'entraînement et votre préférence de split

source: Sets:
es: Series:
fr: Séries :

source: Settings
es: Ajustes
fr: Paramètres

source: Sex
es: Sexo
fr: Sexe

source: Shoulders
es: Hombros
fr: Épaules

source: Signed In
es: Sesión iniciada
fr: Connecté

source: Silver
es: Plata
fr: Argent

source: Sleep
es: Sueño
fr: Sommeil

source: Sleep Deficit
es: Déficit de sueño
fr: Déficit de sommeil

source: Sleep Goal
es: Objetivo de sueño
fr: Objectif de sommeil

source: Smart Nutrition
es: Nutrición inteligente
fr: Nutrition intelligente

source: Source
es: Fuente

source: Split
es: División

source: Sports Drink
es: Bebida deportiva
fr: Boisson sportive

source: Start
es: Comenzar
fr: Commencer

source: Start Workout
es: Iniciar entrenamiento
fr: Commencer l'entraînement

source: Start a streak!
es: ¡Comienza una racha!
fr: Commencez une série !

source: Stay on Track
es: Mantente en el camino
fr: Restez sur la bonne voie

source: Steady
es: Estable
fr: Stable

source: Steps
es: Pasos
fr: Pas

source: Streaks
es: Rachas
fr: Séries

source: Strong momentum. Stay consistent!
es: Gran impulso. ¡Mantén la constancia!
fr: Bon élan. Restez constant !

source: Suggested Meals
es: Comidas sugeridas
fr: Repas suggérés

source: Suggested Workout
es: Entrenamiento sugerido
fr: Entraînement suggéré

source: Suggested: %@
es: Sugerido: %@
fr: Suggéré : %@

source: Summary
es: Resumen
fr: Résumé

source: Sync Now
es: Sincronizar ahora
fr: Synchroniser maintenant

source: Sync with Apple Health
es: Sincronizar con Apple Health
fr: Synchroniser avec Apple Santé

source: Syncing...
es: Sincronizando...
fr: Synchronisation...

source: TDEE
es: GETD
fr: DTEJ

source: TODAY'S PRIORITY
es: PRIORIDAD DE HOY
fr: PRIORITÉ DU JOUR

source: Tap + to log a meal
es: Toca + para registrar una comida
fr: Appuyez sur + pour enregistrer un repas

source: Target
es: Objetivo
fr: Objectif

source: Target & Equipment
es: Objetivo y equipamiento
fr: Objectif et équipement

source: Target Calories
es: Calorías objetivo
fr: Calories cible

source: Target Progress
es: Progreso del objetivo
fr: Progrès de l'objectif

source: Target kcal
es: kcal objetivo
fr: kcal cible

source: Target: %.1f kg
es: Objetivo: %.1f kg
fr: Objectif : %.1f kg

source: Target: %@ kg
es: Objetivo: %@ kg
fr: Objectif : %@ kg

source: Tea
es: Té
fr: Thé

source: Template Name
es: Nombre de la plantilla
fr: Nom du modèle

source: Terms of Use
es: Términos de uso
fr: Conditions d'utilisation

source: This Week
es: Esta semana
fr: Cette semaine

source: This may take a moment
es: Esto puede tardar un momento
fr: Cela peut prendre un moment

source: This week
es: Esta semana
fr: Cette semaine

source: This will delete all your saved meals, weight history, and preferences. This cannot be undone.
es: Esto eliminará todas tus comidas guardadas, historial de peso y preferencias. No se puede deshacer.
fr: Cela supprimera tous vos repas enregistrés, votre historique de poids et vos préférences. Cette action est irréversible.

source: This will reset all your settings to defaults.
es: Esto restablecerá todos tus ajustes a los valores predeterminados.
fr: Cela réinitialisera tous vos paramètres aux valeurs par défaut.

source: Time Range
es: Rango de tiempo
fr: Période

source: Time to refocus. Start with one small win.
es: Es hora de reenfocarse. Comienza con una pequeña victoria.
fr: Il est temps de se recentrer. Commencez par une petite victoire.

source: Tip
es: Consejo
fr: Conseil

source: Tips
es: Consejos
fr: Conseils

source: Today
es: Hoy
fr: Aujourd'hui

source: Today shows unusual values: %@
es: Hoy muestra valores inusuales: %@
fr: Aujourd'hui montre des valeurs inhabituelles : %@

source: Today's Activity
es: Actividad de hoy
fr: Activité du jour

source: Today's Hydration
es: Hidratación de hoy
fr: Hydratation du jour

source: Today's Log
es: Registro de hoy
fr: Journal du jour

source: Today's Meal Plan
es: Plan de comidas de hoy
fr: Plan de repas du jour

source: Today's Meals
es: Comidas de hoy
fr: Repas du jour

source: Today's Recovery
es: Recuperación de hoy
fr: Récupération du jour

source: Total Exercises
es: Total de ejercicios
fr: Total d'exercices

source: Total Sets
es: Total de series
fr: Total de séries

source: Tracking...
es: Rastreando...
fr: Suivi en cours...

source: Training
es: Entrenamiento
fr: Entraînement

source: Training Split
es: División de entrenamiento
fr: Split d'entraînement

source: Triceps
es: Tríceps

source: Type
es: Tipo

source: Unable to generate recovery insight at this time.
es: No se puede generar el análisis de recuperación en este momento.
fr: Impossible de générer l'analyse de récupération pour le moment.

source: Understand your body's patterns
es: Comprende los patrones de tu cuerpo
fr: Comprenez les rythmes de votre corps

source: Underweight
es: Bajo peso
fr: Insuffisance pondérale

source: Unlimited Plans
es: Planes ilimitados
fr: Plans illimités

source: Unlock detailed charts and trends to track your fitness journey.
es: Desbloquea gráficos y tendencias detallados para seguir tu progreso fitness.
fr: Débloquez des graphiques et tendances détaillés pour suivre votre parcours fitness.

source: Unlock detailed charts, trends, and AI-powered recovery insights
es: Desbloquea gráficos detallados, tendencias y análisis de recuperación con IA
fr: Débloquez des graphiques détaillés, des tendances et des analyses de récupération par IA

source: Unlocked %@
es: Desbloqueado %@
fr: Débloqué %@

source: Unusual Pattern
es: Patrón inusual
fr: Schéma inhabituel

source: Unusual: %@
es: Inusual: %@
fr: Inhabituel : %@

source: Upgrade
es: Mejorar plan
fr: Mettre à niveau

source: Upgrade to Premium
es: Actualizar a Premium
fr: Passer à Premium

source: Version
es: Versión

source: Very Active
es: Muy activo
fr: Très actif

source: Very hard exercise & physical job
es: Ejercicio muy intenso y trabajo físico
fr: Exercice très intense et travail physique

source: Water
es: Agua
fr: Eau

source: Week Streak
es: Racha semanal
fr: Série hebdomadaire

source: Weekly
es: Semanal
fr: Hebdomadaire

source: Weekly Goal Achieved!
es: ¡Objetivo semanal alcanzado!
fr: Objectif hebdomadaire atteint !

source: Weekly Workouts: %lld
es: Entrenamientos semanales: %lld
fr: Entraînements hebdomadaires : %lld

source: Weight
es: Peso
fr: Poids

source: Weight Entries
es: Entradas de peso
fr: Entrées de poids

source: Weight Goal
es: Objetivo de peso
fr: Objectif de poids

source: Weight History
es: Historial de peso
fr: Historique de poids

source: Weight Progress
es: Progreso de peso
fr: Progrès de poids

source: Weight Trend
es: Tendencia de peso
fr: Tendance de poids

source: Weight Trends
es: Tendencias de peso
fr: Tendances de poids

source: Weight: %.1f kg
es: Peso: %.1f kg
fr: Poids : %.1f kg

source: Welcome aboard, %@!
es: ¡Bienvenido a bordo, %@!
fr: Bienvenue à bord, %@ !

source: Welcome to FitPulse
es: Bienvenido a FitPulse
fr: Bienvenue sur FitPulse

source: What are you training for and what's your experience level?
es: ¿Para qué entrenas y cuál es tu nivel de experiencia?
fr: Pour quoi vous entraînez-vous et quel est votre niveau d'expérience ?

source: What do you want to achieve?
es: ¿Qué quieres lograr?
fr: Que voulez-vous accomplir ?

source: What should I eat before training?
es: ¿Qué debo comer antes de entrenar?
fr: Que dois-je manger avant l'entraînement ?

source: What should I train today?
es: ¿Qué debo entrenar hoy?
fr: Que dois-je entraîner aujourd'hui ?

source: What's your goal?
es: ¿Cuál es tu objetivo?
fr: Quel est votre objectif ?

source: Workout
es: Entrenamiento
fr: Entraînement

source: Workout Coach
es: Entrenador
fr: Coach d'entraînement

source: Workout Time
es: Tiempo de entrenamiento
fr: Temps d'entraînement

source: Workout Volume
es: Volumen de entrenamiento
fr: Volume d'entraînement

source: Workout, nutrition & weight trends
es: Tendencias de entrenamiento, nutrición y peso
fr: Tendances d'entraînement, nutrition et poids

source: Workouts
es: Entrenamientos
fr: Entraînements

source: Yearly
es: Anual
fr: Annuel

source: You can skip this step and connect later in Settings
es: Puedes saltar este paso y conectar después en Ajustes
fr: Vous pouvez ignorer cette étape et vous connecter plus tard dans les paramètres

source: You crushed it! %lld %@ achieved.
es: ¡Lo lograste! %lld %@ alcanzados.
fr: Vous avez réussi ! %lld %@ atteints.

source: You slept %@h, below your %@h goal.
es: Dormiste %@h, por debajo de tu objetivo de %@h.
fr: Vous avez dormi %@h, en dessous de votre objectif de %@h.

source: You trained %lld fewer times than last week. Stay consistent!
es: Entrenaste %lld veces menos que la semana pasada. ¡Mantén la constancia!
fr: Vous vous êtes entraîné %lld fois de moins que la semaine dernière. Restez constant !

source: You're All Set!
es: ¡Todo listo!
fr: Vous êtes prêt !

source: You're Crushing It!
es: ¡Lo estás aplastando!
fr: Vous déchirez tout !

source: You're behind on water. Drink a glass to boost energy.
es: Estás atrasado con el agua. Bebe un vaso para aumentar tu energía.
fr: Vous êtes en retard sur l'eau. Buvez un verre pour booster votre énergie.

source: You're hitting your calorie targets. Keep it up!
es: Estás alcanzando tus objetivos de calorías. ¡Sigue así!
fr: Vous atteignez vos objectifs caloriques. Continuez !

source: You're on fire! Keep this energy going.
es: ¡Estás en racha! Mantén esta energía.
fr: Vous êtes en feu ! Gardez cette énergie.

source: You've hit your %lld workout goal this week.
es: Has alcanzado tu objetivo de %lld entrenamientos esta semana.
fr: Vous avez atteint votre objectif de %lld entraînements cette semaine.

source: You've hit your workout goal. Great consistency!
es: Has alcanzado tu objetivo de entrenamiento. ¡Gran constancia!
fr: Vous avez atteint votre objectif d'entraînement. Excellente régularité !

source: You've used your free plans this month. Upgrade for unlimited AI-generated plans.
es: Has usado tus planes gratuitos este mes. Actualiza para planes ilimitados generados por IA.
fr: Vous avez utilisé vos plans gratuits ce mois-ci. Passez à la version supérieure pour des plans IA illimités.

source: Your Daily Targets
es: Tus objetivos diarios
fr: Vos objectifs quotidiens

source: Your Goal
es: Tu objetivo
fr: Votre objectif

source: Your Name
es: Tu nombre
fr: Votre nom

source: Your Streaks
es: Tus rachas
fr: Vos séries

source: Your Targets
es: Tus objetivos
fr: Vos objectifs

source: Your average workout is %lld minutes. Ideal range is 45-90 minutes.
es: Tu entrenamiento promedio es de %lld minutos. El rango ideal es de 45-90 minutos.
fr: Votre entraînement moyen dure %lld minutes. La plage idéale est de 45 à 90 minutes.

source: Your body needs recovery. Take it easy today.
es: Tu cuerpo necesita recuperarse. Tómatelo con calma hoy.
fr: Votre corps a besoin de récupérer. Allez-y doucement aujourd'hui.

source: Your data stays on device. Sign in to enable cloud backup.
es: Tus datos se quedan en el dispositivo. Inicia sesión para habilitar la copia de seguridad en la nube.
fr: Vos données restent sur l'appareil. Connectez-vous pour activer la sauvegarde cloud.

source: Your intelligent fitness companion that adapts to your body's signals
es: Tu compañero inteligente de fitness que se adapta a las señales de tu cuerpo
fr: Votre compagnon fitness intelligent qui s'adapte aux signaux de votre corps

source: Your name
es: Tu nombre
fr: Votre nom

source: e.g. Push Day A
es: ej. Día de empuje A
fr: ex. Jour Poussée A

source: friend
es: amigo
fr: ami

source: kcal burned
es: kcal quemadas
fr: kcal brûlées

source: logged
es: registrado
fr: enregistré

source: milliliters
es: mililitros
fr: millilitres

source: month
es: mes
fr: mois

source: of %@ kg
es: de %@ kg
fr: de %@ kg

source: on target
es: en objetivo
fr: dans l'objectif

source: remaining
es: restante
fr: restant

source: to gain
es: para ganar
fr: à prendre

source: to lose
es: para perder
fr: à perdre

source: weeks
es: semanas
fr: semaines

source: year
es: año
fr: an

source: %lldg C
fr: %lldg G

source: **Error:** %@
fr: **Erreur :** %@

source: C
fr: G

source: Core
fr: Abdominaux

source: Manual
fr: Manuel
